{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "467_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "467_pad", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "467", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "467", "inbound_nodes": [[["467_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "317", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "317", "inbound_nodes": [[["467", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "470_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "470_pad", "inbound_nodes": [[["317", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "470", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "470", "inbound_nodes": [[["470_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "320", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "320", "inbound_nodes": [[["470", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "473", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "473", "inbound_nodes": [[["320", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "476", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "476", "inbound_nodes": [[["473", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "325", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "325", "inbound_nodes": [[["476", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "479_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "479_pad", "inbound_nodes": [[["325", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "479", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "479", "inbound_nodes": [[["479_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "328", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "328", "inbound_nodes": [[["479", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "482", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "482", "inbound_nodes": [[["328", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "485", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "485", "inbound_nodes": [[["482", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "333", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "333", "inbound_nodes": [[["485", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "488_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "488_pad", "inbound_nodes": [[["333", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "488", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "488", "inbound_nodes": [[["488_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "336", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "336", "inbound_nodes": [[["488", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "491", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "491", "inbound_nodes": [[["336", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "339", "trainable": true, "dtype": "float32"}, "name": "339", "inbound_nodes": [[["482", 0, 0, {}], ["491", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "494", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "494", "inbound_nodes": [[["339", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "342", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "342", "inbound_nodes": [[["494", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "497_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "497_pad", "inbound_nodes": [[["342", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "497", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "497", "inbound_nodes": [[["497_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "345", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "345", "inbound_nodes": [[["497", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "500", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "500", "inbound_nodes": [[["345", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "503", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "503", "inbound_nodes": [[["500", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "350", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "350", "inbound_nodes": [[["503", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "506_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "506_pad", "inbound_nodes": [[["350", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "506", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "506", "inbound_nodes": [[["506_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "353", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "353", "inbound_nodes": [[["506", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "509", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "509", "inbound_nodes": [[["353", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "356", "trainable": true, "dtype": "float32"}, "name": "356", "inbound_nodes": [[["500", 0, 0, {}], ["509", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "512", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "512", "inbound_nodes": [[["356", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "359", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "359", "inbound_nodes": [[["512", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "515_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "515_pad", "inbound_nodes": [[["359", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "515", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "515", "inbound_nodes": [[["515_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "362", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "362", "inbound_nodes": [[["515", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "518", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "518", "inbound_nodes": [[["362", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "365", "trainable": true, "dtype": "float32"}, "name": "365", "inbound_nodes": [[["356", 0, 0, {}], ["518", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "521", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "521", "inbound_nodes": [[["365", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "368", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "368", "inbound_nodes": [[["521", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "524_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "524_pad", "inbound_nodes": [[["368", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "524", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "524", "inbound_nodes": [[["524_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "371", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "371", "inbound_nodes": [[["524", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "527", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "527", "inbound_nodes": [[["371", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "530", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "530", "inbound_nodes": [[["527", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "376", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "376", "inbound_nodes": [[["530", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "533_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "533_pad", "inbound_nodes": [[["376", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "533", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "533", "inbound_nodes": [[["533_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "379", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "379", "inbound_nodes": [[["533", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "536", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "536", "inbound_nodes": [[["379", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "382", "trainable": true, "dtype": "float32"}, "name": "382", "inbound_nodes": [[["527", 0, 0, {}], ["536", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "539", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "539", "inbound_nodes": [[["382", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "385", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "385", "inbound_nodes": [[["539", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "542_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "542_pad", "inbound_nodes": [[["385", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "542", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "542", "inbound_nodes": [[["542_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "388", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "388", "inbound_nodes": [[["542", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "545", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "545", "inbound_nodes": [[["388", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "391", "trainable": true, "dtype": "float32"}, "name": "391", "inbound_nodes": [[["382", 0, 0, {}], ["545", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "548", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "548", "inbound_nodes": [[["391", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "394", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "394", "inbound_nodes": [[["548", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "551_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "551_pad", "inbound_nodes": [[["394", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "551", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "551", "inbound_nodes": [[["551_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "397", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "397", "inbound_nodes": [[["551", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "554", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "554", "inbound_nodes": [[["397", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "400", "trainable": true, "dtype": "float32"}, "name": "400", "inbound_nodes": [[["391", 0, 0, {}], ["554", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "557", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "557", "inbound_nodes": [[["400", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "403", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "403", "inbound_nodes": [[["557", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "560_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "560_pad", "inbound_nodes": [[["403", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "560", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "560", "inbound_nodes": [[["560_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "406", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "406", "inbound_nodes": [[["560", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "563", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "563", "inbound_nodes": [[["406", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "566", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "566", "inbound_nodes": [[["563", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "411", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "411", "inbound_nodes": [[["566", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "569_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "569_pad", "inbound_nodes": [[["411", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "569", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "569", "inbound_nodes": [[["569_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "414", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "414", "inbound_nodes": [[["569", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "572", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "572", "inbound_nodes": [[["414", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "417", "trainable": true, "dtype": "float32"}, "name": "417", "inbound_nodes": [[["563", 0, 0, {}], ["572", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "575", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "575", "inbound_nodes": [[["417", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "420", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "420", "inbound_nodes": [[["575", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "578_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "578_pad", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "578", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "578", "inbound_nodes": [[["578_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "423", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "423", "inbound_nodes": [[["578", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "581", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "581", "inbound_nodes": [[["423", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "426", "trainable": true, "dtype": "float32"}, "name": "426", "inbound_nodes": [[["417", 0, 0, {}], ["581", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "584", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "584", "inbound_nodes": [[["426", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "429", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "429", "inbound_nodes": [[["584", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "587_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "587_pad", "inbound_nodes": [[["429", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "587", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "587", "inbound_nodes": [[["587_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "432", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "432", "inbound_nodes": [[["587", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "590", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "590", "inbound_nodes": [[["432", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "593", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "593", "inbound_nodes": [[["590", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "437", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "437", "inbound_nodes": [[["593", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "596_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "596_pad", "inbound_nodes": [[["437", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "596", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "596", "inbound_nodes": [[["596_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "440", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "440", "inbound_nodes": [[["596", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "599", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "599", "inbound_nodes": [[["440", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "443", "trainable": true, "dtype": "float32"}, "name": "443", "inbound_nodes": [[["590", 0, 0, {}], ["599", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "602", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "602", "inbound_nodes": [[["443", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "446", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "446", "inbound_nodes": [[["602", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "605_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "605_pad", "inbound_nodes": [[["446", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "605", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "605", "inbound_nodes": [[["605_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "449", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "449", "inbound_nodes": [[["605", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "608", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "608", "inbound_nodes": [[["449", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "452", "trainable": true, "dtype": "float32"}, "name": "452", "inbound_nodes": [[["443", 0, 0, {}], ["608", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "611", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "611", "inbound_nodes": [[["452", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "455", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "455", "inbound_nodes": [[["611", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "614_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "614_pad", "inbound_nodes": [[["455", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "614", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "614", "inbound_nodes": [[["614_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "458", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "458", "inbound_nodes": [[["614", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "617", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "617", "inbound_nodes": [[["458", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "620", "trainable": true, "dtype": "float32", "filters": 1280, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "620", "inbound_nodes": [[["617", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "463", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "463", "inbound_nodes": [[["620", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "464", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "464", "inbound_nodes": [[["463", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "464_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "464_EXPAND1", "inbound_nodes": [[["464", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "464_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "464_EXPAND2", "inbound_nodes": [[["464_EXPAND1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "465", "trainable": true, "dtype": "float32", "target_shape": [-1]}, "name": "465", "inbound_nodes": [[["464_EXPAND2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["465", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "467/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "467/bias", "shape": [32], "dtype": "float32"}, {"name": "470/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "470/bias", "shape": [32], "dtype": "float32"}, {"name": "473/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "473/bias", "shape": [16], "dtype": "float32"}, {"name": "476/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "476/bias", "shape": [96], "dtype": "float32"}, {"name": "479/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "479/bias", "shape": [96], "dtype": "float32"}, {"name": "482/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "482/bias", "shape": [24], "dtype": "float32"}, {"name": "485/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "485/bias", "shape": [144], "dtype": "float32"}, {"name": "488/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "488/bias", "shape": [144], "dtype": "float32"}, {"name": "491/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "491/bias", "shape": [24], "dtype": "float32"}, {"name": "494/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "494/bias", "shape": [144], "dtype": "float32"}, {"name": "497/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "497/bias", "shape": [144], "dtype": "float32"}, {"name": "500/kernel", "shape": [1, 1, 144, 32], "dtype": "float32"}, {"name": "500/bias", "shape": [32], "dtype": "float32"}, {"name": "503/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "503/bias", "shape": [192], "dtype": "float32"}, {"name": "506/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "506/bias", "shape": [192], "dtype": "float32"}, {"name": "509/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "509/bias", "shape": [32], "dtype": "float32"}, {"name": "512/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "512/bias", "shape": [192], "dtype": "float32"}, {"name": "515/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "515/bias", "shape": [192], "dtype": "float32"}, {"name": "518/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "518/bias", "shape": [32], "dtype": "float32"}, {"name": "521/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "521/bias", "shape": [192], "dtype": "float32"}, {"name": "524/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "524/bias", 