{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "649_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "649_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "649", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "649", "inbound_nodes": [[["649_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "363", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "363", "inbound_nodes": [[["649", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "364", "trainable": true, "dtype": "float32"}, "name": "364", "inbound_nodes": [[["649", 0, 0, {}], ["363", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "652_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "652_pad", "inbound_nodes": [[["364", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "652", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "652", "inbound_nodes": [[["652_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "367", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "367", "inbound_nodes": [[["652", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "368", "trainable": true, "dtype": "float32"}, "name": "368", "inbound_nodes": [[["652", 0, 0, {}], ["367", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "369", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "369", "inbound_nodes": [[["368", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "369_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "369_EXPAND1", "inbound_nodes": [[["369", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "369_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "369_EXPAND2", "inbound_nodes": [[["369_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "370", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "370", "inbound_nodes": [[["369_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "371", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "371", "inbound_nodes": [[["370", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "372", "trainable": true, "dtype": "float32"}, "name": "372", "inbound_nodes": [[["370", 0, 0, {}], ["371", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "373", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "373", "inbound_nodes": [[["372", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "374", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "374", "inbound_nodes": [[["373", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "375", "trainable": true, "dtype": "float32"}, "name": "375", "inbound_nodes": [[["374", 0, 0, {}], ["368", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "655", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "655", "inbound_nodes": [[["375", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "658", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "658", "inbound_nodes": [[["655", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "380", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "380", "inbound_nodes": [[["658", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "381", "trainable": true, "dtype": "float32"}, "name": "381", "inbound_nodes": [[["658", 0, 0, {}], ["380", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "661_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "661_pad", "inbound_nodes": [[["381", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "661", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "661", "inbound_nodes": [[["661_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "384", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "384", "inbound_nodes": [[["661", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "385", "trainable": true, "dtype": "float32"}, "name": "385", "inbound_nodes": [[["661", 0, 0, {}], ["384", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "386", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "386", "inbound_nodes": [[["385", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "386_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "386_EXPAND1", "inbound_nodes": [[["386", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "386_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "386_EXPAND2", "inbound_nodes": [[["386_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "387", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "387", "inbound_nodes": [[["386_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "388", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "388", "inbound_nodes": [[["387", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "389", "trainable": true, "dtype": "float32"}, "name": "389", "inbound_nodes": [[["387", 0, 0, {}], ["388", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "390", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "390", "inbound_nodes": [[["389", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "391", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "391", "inbound_nodes": [[["390", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "392", "trainable": true, "dtype": "float32"}, "name": "392", "inbound_nodes": [[["391", 0, 0, {}], ["385", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "664", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "664", "inbound_nodes": [[["392", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "667", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "667", "inbound_nodes": [[["664", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "397", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "397", "inbound_nodes": [[["667", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "398", "trainable": true, "dtype": "float32"}, "name": "398", "inbound_nodes": [[["667", 0, 0, {}], ["397", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "670_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "670_pad", "inbound_nodes": [[["398", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "670", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "670", "inbound_nodes": [[["670_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "401", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "401", "inbound_nodes": [[["670", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "402", "trainable": true, "dtype": "float32"}, "name": "402", "inbound_nodes": [[["670", 0, 0, {}], ["401", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "403", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "403", "inbound_nodes": [[["402", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "403_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "403_EXPAND1", "inbound_nodes": [[["403", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "403_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "403_EXPAND2", "inbound_nodes": [[["403_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "404", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "404", "inbound_nodes": [[["403_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "405", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "405", "inbound_nodes": [[["404", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "406", "trainable": true, "dtype": "float32"}, "name": "406", "inbound_nodes": [[["404", 0, 0, {}], ["405", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "407", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "407", "inbound_nodes": [[["406", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "408", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "408", "inbound_nodes": [[["407", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "409", "trainable": true, "dtype": "float32"}, "name": "409", "inbound_nodes": [[["408", 0, 0, {}], ["402", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "673", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "673", "inbound_nodes": [[["409", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "412", "trainable": true, "dtype": "float32"}, "name": "412", "inbound_nodes": [[["673", 0, 0, {}], ["664", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "676", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "676", "inbound_nodes": [[["412", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "415", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "415", "inbound_nodes": [[["676", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "416", "trainable": true, "dtype": "float32"}, "name": "416", "inbound_nodes": [[["676", 0, 0, {}], ["415", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "679_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "679_pad", "inbound_nodes": [[["416", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "679", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "679", "inbound_nodes": [[["679_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "419", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "419", "inbound_nodes": [[["679", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "420", "trainable": true, "dtype": "float32"}, "name": "420", "inbound_nodes": [[["679", 0, 0, {}], ["419", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "421", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "421", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "421_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "421_EXPAND1", "inbound_nodes": [[["421", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "421_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "421_EXPAND2", "inbound_nodes": [[["421_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "422", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "422", "inbound_nodes": [[["421_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "423", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "423", "inbound_nodes": [[["422", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "424", "trainable": true, "dtype": "float32"}, "name": "424", "inbound_nodes": [[["422", 0, 0, {}], ["423", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "425", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "425", "inbound_nodes": [[["424", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "426", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "426", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "427", "trainable": true, "dtype": "float32"}, "name": "427", "inbound_nodes": [[["426", 0, 0, {}], ["420", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "682", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "682", "inbound_nodes": [[["427", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "685", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "685", "inbound_nodes": [[["682", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "432", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "432", "inbound_nodes": [[["685", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "433", "trainable": true, "dtype": "float32"}, "name": "433", "inbound_nodes": [[["685", 0, 0, {}], ["432", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "688_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "688_pad", "inbound_nodes": [[["433", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "688", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "688", "inbound_nodes": [[["688_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "436", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "436", "inbound_nodes": [[["688", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "437", "trainable": true, "dtype": "float32"}, "name": "437", "inbound_nodes": [[["688", 0, 0, {}], ["436", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "438", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "438", "inbound_nodes": [[["437", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "438_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "438_EXPAND1", "inbound_nodes": [[["438", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "438_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "438_EXPAND2", "inbound_nodes": [[["438_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "439", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "439", "inbound_nodes": [[["438_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "440", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "440", "inbound_nodes": [[["439", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "441", "trainable": true, "dtype": "float32"}, "name": "441", "inbound_nodes": [[["439", 0, 0, {}], ["440", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "442", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "442", "inbound_nodes": [[["441", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "443", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "443", "inbound_nodes": [[["442", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "444", "trainable": true, "dtype": "float32"}, "name": "444", "inbound_nodes": [[["443", 0, 0, {}], ["437", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "691", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "691", "inbound_nodes": [[["444", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "447", "trainable": true, "dtype": "float32"}, "name": "447", "inbound_nodes": [[["691", 0, 0, {}], ["682", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "694", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "694", "inbound_nodes": [[["447", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "450", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "450", "inbound_nodes": [[["694", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "451", "trainable": true, "dtype": "float32"}, "name": "451", "inbound_nodes": [[["694", 0, 0, {}], ["450", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "697_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "697_pad", "inbound_nodes": [[["451", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "697", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "697", "inbound_nodes": [[["697_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "454", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "454", "inbound_nodes": [[["697", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "455", "trainable": true, "dtype": "float32"}, "name": "455", "inbound_nodes": [[["697", 0, 0, {}], ["454", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "456", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "456", "inbound_nodes": [[["455", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "456_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "456_EXPAND1", "inbound_nodes": [[["456", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "456_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "456_EXPAND2", "inbound_nodes": [[["456_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "457", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "457", "inbound_nodes": [[["456_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "458", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "458", "inbound_nodes": [[["457", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "459", "trainable": true, "dtype": "float32"}, "name": "459", "inbound_nodes": [[["457", 0, 0, {}], ["458", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "460", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "460", "inbound_nodes": [[["459", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "461", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "461", "inbound_nodes": [[["460", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "462", "trainable": true, "dtype": "float32"}, "name": "462", "inbound_nodes": [[["461", 0, 0, {}], ["455", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "700", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "700", "inbound_nodes": [[["462", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "703", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "703", "inbound_nodes": [[["700", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "467", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "467", "inbound_nodes": [[["703", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "468", "trainable": true, "dtype": "float32"}, "name": "468", "inbound_nodes": [[["703", 0, 0, {}], ["467", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "706_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "706_pad", "inbound_nodes": [[["468", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "706", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "706", "inbound_nodes": [[["706_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "471", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "471", "inbound_nodes": [[["706", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "472", "trainable": true, "dtype": "float32"}, "name": "472", "inbound_nodes": [[["706", 0, 0, {}], ["471", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "473", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "473", "inbound_nodes": [[["472", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "473_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "473_EXPAND1", "inbound_nodes": [[["473", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "473_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "473_EXPAND2", "inbound_nodes": [[["473_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "474", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "474", "inbound_nodes": [[["473_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "475", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "475", "inbound_nodes": [[["474", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "476", "trainable": true, "dtype": "float32"}, "name": "476", "inbound_nodes": [[["474", 0, 0, {}], ["475", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "477", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "477", "inbound_nodes": [[["476", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "478", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "478", "inbound_nodes": [[["477", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "479", "trainable": true, "dtype": "float32"}, "name": "479", "inbound_nodes": [[["478", 0, 0, {}], ["472", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "709", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "709", "inbound_nodes": [[["479", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "482", "trainable": true, "dtype": "float32"}, "name": "482", "inbound_nodes": [[["709", 0, 0, {}], ["700", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "712", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "712", "inbound_nodes": [[["482", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "485", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "485", "inbound_nodes": [[["712", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "486", "trainable": true, "dtype": "float32"}, "name": "486", "inbound_nodes": [[["712", 0, 0, {}], ["485", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "715_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "715_pad", "inbound_nodes": [[["486", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "715", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "715", "inbound_nodes": [[["715_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "489", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "489", "inbound_nodes": [[["715", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "490", "trainable": true, "dtype": "float32"}, "name": "490", "inbound_nodes": [[["715", 0, 0, {}], ["489", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "491", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "491", "inbound_nodes": [[["490", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "491_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "491_EXPAND1", "inbound_nodes": [[["491", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "491_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+i9DOi9Vc2Vycy9jYXN0cm9mbS9BcHBEYXRhL1JvYW1pbmcvUHl0aG9u\nL1B5dGhvbjM5L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFy\nZ2V0X2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "491_EXPAND2", "inbound_nodes": [[["491_EXPAND1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "492", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "492", "inbound_nodes": [[["491_EXPAND2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "493", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "493", "inbound_nodes": [[["492", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "494", "trainable": true, "dtype": "float32"}, "name": "494", "inbound_nodes": [[["492", 0, 0, {}], ["493", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "495", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": 